Ran Plan for dir: `terraform-aws` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web_app will be created
+ resource "aws_instance" "web_app" {
      + ami                                  = "ami-674cbc1e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "m5.8xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "my_data"
          + encrypted             = (known after apply)
          + iops                  = 801
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 1000
          + volume_type           = "io1"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
+ resource "aws_lambda_function" "hello_world" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "hello_world"
      + handler                        = "exports.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:lambda:us-east-1:account-id:resource-id"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


Detected Terraform plan JSON file at /home/atlantis/.atlantis/repos/tim775/atlantis-demo/5/default/terraform-aws/default.json
  [96;1m⠋[0m Calculating monthly cost estimate   [96;1m⠙[0m Calculating monthly cost estimate   [96;1m⠹[0m Calculating monthly cost estimate   [96;1m⠸[0m Calculating monthly cost estimate   [96;1m⠼[0m Calculating monthly cost estimate   [96;1m⠴[0m Calculating monthly cost estimate   [96;1m⠦[0m Calculating monthly cost estimate   [96;1m⠧[0m Calculating monthly cost estimate   [96;1m⠇[0m Calculating monthly cost estimate   [96;1m⠏[0m Calculating monthly cost estimate   [96;1m⠋[0m Calculating monthly cost estimate   [96m✔[0m Calculating monthly cost estimate

[1mProject:[0m github.com/tim775/atlantis-demo.git/terraform-aws/default.json

 [4mName[0m                                                           [4mMonthly Qty[0m  [4mUnit[0m                        [4mMonthly Cost[0m 
                                                                                                                      
 [1maws_instance.web_app[0m                                                                                                 
 [2m├─[0m Instance usage (Linux/UNIX, on-demand, m5.8xlarge)                  730  hours                          $1,121.28 
 [2m├─[0m root_block_device                                                                                                 
 [2m│  └─[0m Storage (general purpose SSD, gp2)                                50  GB                                 $5.00 
 [2m└─[0m ebs_block_device[0]                                                                                               
 [2m   ├─[0m Storage (provisioned IOPS SSD, io1)                            1,000  GB                               $125.00 
 [2m   └─[0m Provisioned IOPS                                                 801  IOPS                              $52.07 
                                                                                                                      
 [1maws_lambda_function.hello_world[0m                                                                                      
 [2m├─[0m Requests                                            Monthly cost depends on usage: $0.20 per 1M requests          
 [2m└─[0m Duration                                            Monthly cost depends on usage: $0.0000166667 per GB-seconds   
                                                                                                                      
[1m OVERALL TOTAL[0m                                                                                              $1,303.35 
──────────────────────────────────
2 cloud resources were detected, rerun with --show-skipped to see details:
∙ 2 were estimated, 2 include usage-based costs, see [94mhttps://infracost.io/usage-file[0m

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://bd69fa838be7:4141/lock?id=tim775%252Fatlantis-demo%252Fterraform-aws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-aws`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
